//
// Created by hikarido on 6/24/18.
// Программа возводящая переданный аргумент в квадрат
// Task from coursera
// https://www.coursera.org/learn/c-plus-plus-yellow/programming/YQJs1/vsio-v-kvadrat

// у нас есть пара вектор и мапа
// они содержат друг друга произвольно и не попорядку , а бы как
// на самом нижнем уровне находятся числа, некие, их нужно возвести в квадрат
// и затем медленно подниматься на верх возводя в квадрат вся и всех

// 1) определим функции вывода пары, вектопра и карт
// 2) определим возведение в квадрат
// * пары
// * вектора
// * словаря
// 3) протестируем решение




int main(){
	// code
	return 0;
}

